Revit 2027 API
BuiltInFailures.RebarFailures.TrySmallerBarType Property
 Rebar Bend Diameter is too large. Try a smaller Bar Type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TrySmallerBarType { get; }
Public Shared ReadOnly Property TrySmallerBarType As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TrySmallerBarType {
	FailureDefinitionId^ get ();
}
static member TrySmallerBarType : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace